using System;
using System.IO;
using iCareData;
using System.Collections;
using System.Drawing.Printing;
using com.digitalwave.controls;
using System.Drawing;
using System.Windows.Forms;

namespace iCare 
{
	/// <summary>
	/// 按新规范
	/// 儿科科住院病历打印工具类.
	/// </summary>
	public class clsIMR_PaediatricsPrintTool01: clsInpatMedRecPrintBase
	{
		public clsIMR_PaediatricsPrintTool01(string p_strTypeID) :base(p_strTypeID)
		{}


		private clsPrintInPatMedRecItem[] m_objPrintMultiItemArr;
		private clsPrintInPatMedRecSign[] m_objPrintSignArr;
       
	
		protected override void m_mthSetPrintLineArr()
		{

			m_mthInitPrintLineArr();
			m_objPrintLineContext = new com.digitalwave.Utility.Controls.clsPrintContext(
				new com.digitalwave.Utility.Controls.clsPrintLineBase[]{
										  new clsPrintPatientFixInfo("儿科入院记录",320),
										  m_objPrintMultiItemArr[0],m_objPrintMultiItemArr[26],m_objPrintMultiItemArr[1],
										  m_objPrintMultiItemArr[2],m_objPrintMultiItemArr[3],m_objPrintMultiItemArr[4],
										  m_objPrintMultiItemArr[5],m_objPrintMultiItemArr[6],m_objPrintMultiItemArr[7],
										  m_objPrintMultiItemArr[8],m_objPrintMultiItemArr[9],m_objPrintMultiItemArr[10],
										  m_objPrintMultiItemArr[11],m_objPrintMultiItemArr[12],m_objPrintMultiItemArr[13],
										  m_objPrintMultiItemArr[14],m_objPrintMultiItemArr[15],m_objPrintMultiItemArr[16],
										  m_objPrintMultiItemArr[17],m_objPrintMultiItemArr[18],m_objPrintMultiItemArr[19],
										  m_objPrintMultiItemArr[20],m_objPrintMultiItemArr[21],m_objPrintMultiItemArr[22],
										  m_objPrintMultiItemArr[23],m_objPrintMultiItemArr[24], m_objPrintMultiItemArr[25],
                                          m_objPrintMultiItemArr[27],m_objPrintMultiItemArr[28], m_objPrintMultiItemArr[29],
                                          m_objPrintMultiItemArr[30],m_objPrintMultiItemArr[31], m_objPrintMultiItemArr[32],
                                          m_objPrintMultiItemArr[33],m_objPrintMultiItemArr[34], m_objPrintMultiItemArr[35],
                                          m_objPrintMultiItemArr[36]
										  
									  });
		}
	
		private void m_mthInitPrintLineArr()
		{


			m_objPrintMultiItemArr = new clsPrintInPatMedRecItem[37];
			for(int j2=0;j2<m_objPrintMultiItemArr.Length;j2++)
				m_objPrintMultiItemArr[j2] = new clsPrintInPatMedRecItem();

            //m_objPrintSignArr = new clsPrintInPatMedRecSign[1];
            //for(int k3=0;k3<m_objPrintSignArr.Length;k3++)
            //    m_objPrintSignArr[k3] = new clsPrintInPatMedRecSign();
		}

	protected override void m_mthSetSubPrintInfo()
		{
			#region 抬头信息
			m_objPrintMultiItemArr[0].m_mthSetPrintValue(new string[]{"联系电话","出生年月",
																		 "父姓名","父年龄","父文化程度","父职业","父地址",
																		 "母姓名","母年龄","母文化程度","母职业","母地址",""},
				new string[]{"联系电话：","出生年月：",
								"\n 父姓名：","年龄：","文化程度：","职业：","地址：",
								"\n 母姓名：","年龄：","文化程度：","职业：","地址：",""});
				m_objPrintMultiItemArr[0].m_mthSetPrintValue(new string[]{"主诉",""},
					new string[]{"\n主诉：",""});
                //m_objPrintMultiItemArr[0].m_mthSetPrintValue(new string[]{"现病史"},
                //    new string[]{"\n现病史："});
		#endregion
                #region 现病史
                m_objPrintMultiItemArr[26].m_mthSetPrintValue("现病史", "现病史：");
                #endregion
                #region 既往史
                m_objPrintMultiItemArr[1].m_mthSetPrintValue(new string[]{"",
																			"","既往史>>平素体质>>好","既往史>>平素体质>>一般","既往史>>平素体质>>差",
																			"","既往史>>急慢性病、传染病以及接触史>>无","既往史>>急慢性病、传染病以及接触史",
																			"","既往史>>输血史>>无","既往史>>输血史",
																			"","既往史>>食物、药物过敏史>>无","既往史>>食物、药物过敏史",
																			"","既往史>>手术、外伤史>>无","既往史>>手术、外伤史",
																			"","既往史>>既往病史>>无","既往史>>既往病史","既往史>>既往病史"},
					new string[]{"\n既往史：",
									"\n    平素体质：","#好","#一般","#差",
									"急慢性病、传染病史及其接触史：","#无"," ",
									"输血史：","#无","",
									"\n    食物、药物过敏史：","#无","",
									"手术、外伤史：","#无","",
									"既往病史：","#无；","","#；"});


			#endregion
		
			#region 个人史

			#region 出生史
			 
				//
				m_objPrintMultiItemArr[2].m_mthSetPrintValue(new String[]{"","",
																			"个人史>>出生史>>胎次",
																			"个人史>>出生史>>胎次",
																			"个人史>>出生史>>产次","个人史>>出生史>>产次",
																			"个人史>>出生史>>孕周"},
					new String[]{"\n个人史：","\n    出生史：",
											"第","#胎",
											"第","#产",
											"孕周："});
				//
				m_objPrintMultiItemArr[2].m_mthSetPrintValue(new string[]{"",
																			"个人史>>出生史>>产式>>顺产",
																			"个人史>>出生史>>产式>>剖宫产",
																			"个人史>>出生史>>产式>>钳产",
																			"个人史>>出生史>>产式>>吸引产",
																			"个人史>>出生史>>产式>>臀助产",
																			"个人史>>出生史>>产式>>急产",
																			"个人史>>出生史>>产式>>滞产",
																			"","个人史>>出生史>>窒息>>无","个人史>>出生史>>窒息>>轻","个人史>>出生史>>窒息>>重",
																			"","个人史>>出生史>>抢救>>无","个人史>>出生史>>抢救>>有","个人史>>出生史>>抢救>>描述",
																			"","个人史>>出生史>>黄疸>>无","个人史>>出生史>>黄疸>>有",
																			"个人史>>出生史>>体重",
																			"个人史>>出生史>>身长","个人史>>出生史>>身长"},
					new string[]{
								"；产式：",
								"#顺产",
								"#剖宫产",
								"#钳产",
								"#吸引产",
								"#臀助产",
								"#急产",
								"#滞产",
								"窒息：",
								"#无",
								"#轻",
								"#重",
								"抢救：",
								"#无",
								"#有","",
								"黄疸：",
								"#无",
								"#有",
								"\n    体重(Kg)：","身长(cm)：","#；"});


			#endregion

			#region 营养史
				m_objPrintMultiItemArr[3].m_mthSetPrintValue(new string[]{
																		"",
																		"",
																		"个人史>>营养史>>婴儿期喂养方式",""},
					new string[]{"    营养史：",
								"婴儿期喂养方式：",
								"$$",""});
					
				m_objPrintMultiItemArr[3].m_mthSetPrintValue(new string[]{
																		"",
																		"个人史>>营养史>>辅食添加>>维生素AD",
																		"个人史>>营养史>>辅食添加>>果汁",
																		"个人史>>营养史>>辅食添加>>蛋黄",
																		"个人史>>营养史>>辅食添加>>菜泥",
																		"个人史>>营养史>>辅食添加>>淀粉类食物",
																		"个人史>>营养史>>辅食添加>>其它",""},
                    new string[]{"\n        辅食添加：（注明开始月龄）",
								"维生素A+D：",
								"果汁：",
								"蛋黄：",
								"菜泥：",
								"淀粉类食物：",
								"其它：",""});
					
				m_objPrintMultiItemArr[3].m_mthSetPrintValue(new string[]{
																"个人史>>营养史>>现在开始喂养",
																"",
																"个人史>>营养史>>体重增长>>过快",
																"个人史>>营养史>>体重增长>>正常",
																"个人史>>营养史>>体重增长>>不增",
																"个人史>>营养史>>体重增长>>渐减"},
					new string[]{
									"\n        现在开始喂养：",
									"体重增长：",
									"#过快；",
									"#正常；",
									"#不增；",
									"#渐减；"});
			#endregion

			#region 发育史
			
				m_objPrintMultiItemArr[4].m_mthSetPrintValue(new string[]{"","","个人史>>发育史>>神经精神发育>>月开始抬头","个人史>>发育史>>神经精神发育>>月开始抬头",
																			"个人史>>发育史>>神经精神发育>>月会坐","个人史>>发育史>>神经精神发育>>月会坐",
																			"个人史>>发育史>>神经精神发育>>月会站","个人史>>发育史>>神经精神发育>>月会站",
																			"个人史>>发育史>>神经精神发育>>月会走","个人史>>发育史>>神经精神发育>>月会走",
																			"个人史>>发育史>>神经精神发育>>月出牙","个人史>>发育史>>神经精神发育>>月出牙",
																			"个人史>>发育史>>神经精神发育>>月会笑","个人史>>发育史>>神经精神发育>>月会笑",
																			"个人史>>发育史>>神经精神发育>>月认人","个人史>>发育史>>神经精神发育>>月认人",
																			"个人史>>发育史>>神经精神发育>>月说话","个人史>>发育史>>神经精神发育>>月说话",
																			"个人史>>发育史>>神经精神发育>>其它",""},
					new string[]{"    生长发育：","\n    神经精神发育：",
									"","#月开始抬头",
									"","#月会坐",
									"","#月会站",
									"","#月会走",
									"","#月出牙",
									"","#月会笑",
									"\n                                  ","#月认人",
									"","#月说话",
									"其它：",""});
			#endregion

			#region 预防接种史
				m_objPrintMultiItemArr[5].m_mthSetPrintValue(new string[]{
																	"",
																	"",
																	"个人史>>预防接种史>>卡介苗>>无",
																	"个人史>>预防接种史>>卡介苗>>有",
																	"",
																	"个人史>>预防接种史>>百白破>>无",
																	"个人史>>预防接种史>>百白破>>有",
																	"",
																	"个人史>>预防接种史>>麻疹>>无",
																	"个人史>>预防接种史>>麻疹>>有",
																	"",
																	"个人史>>预防接种史>>脊髓灰质炎>>无",
																	"个人史>>预防接种史>>脊髓灰质炎疫苗>>有",
																	"",
																	"个人史>>预防接种史>>流脑>>无",
																	"个人史>>预防接种史>>流脑>>有",
																	"",
																	"个人史>>预防接种史>>乙脑疫苗>>无",
																	"个人史>>预防接种史>>乙脑疫苗>>有",
																	"",
																	"个人史>>预防接种史>>乙肝>>无",
																	"个人史>>预防接种史>>乙肝>>有",
																	"个人史>>预防接种史>>其它",""}
					,new string[]{
								"    预防接种史：",
								"\n        卡介苗：",
								"#无",
								"#有",
								"百白破：",
								"#无",
								"#有",
								"麻疹：",
								"#无",
								"#有",
								"脊髓灰质炎：",
								"#无",
								"#有",
								"流脑：",
								"#无",
								"#有",
								"乙脑：",
								"#无",
								"#有",
								"乙肝：",
								"#无",
								"#有",
								"其它：",""});


			#endregion

			#region 生活环境
				m_objPrintMultiItemArr[6].m_mthSetPrintValue(new string[]{
																			"",
																			"个人史>>生活环境>>住家中",
																			"个人史>>生活环境>>日托",
																			"个人史>>生活环境>>全托"},
					new string[]{
								"    生活环境：",
								"#住家中；",
								"#日托；",
								"#全托；"});
					
				m_objPrintMultiItemArr[6].m_mthSetPrintValue(new string[]{
														"个人史>>生活环境>>居住条件",
														"个人史>>生活环境>>当地有何地方病",""},
										new string[]{
												"\n    居住条件：",
												"\n    当地有何地方病：",""});
																	
			#endregion

			#endregion

			#region 家族史
				m_objPrintMultiItemArr[7].m_mthSetPrintValue(new string[]{
																		"",
																		"",
																		"家族史>>父亲体质>>好",
																		"家族史>>父亲体质>>一般",
																		"家族史>>父亲体质>>差",
																		"家族史>>父亲体质>>已故",
																		"",
																		"家族史>>传染病及其接触史>>无",
																		"家族史>>传染病及其接触史",
																		"",
																		"家族史>>母亲体质>>好",
																		"家族史>>母亲体质>>一般",
																		"家族史>>母亲体质>>差",
																		"家族史>>母亲体质>>已故",
																		"",
																		"家族史>>家族性遗产疾病>>无",
																		"家族史>>家族性遗产疾病",
																		"",
																		"家族史>>父母近亲结婚>>无",
																		"家族史>>父母近亲结婚",
																		"",
																		"家族史>>单亲家庭>>是",
																		"家族史>>单亲家庭>>否"},
					new string[]{
							"\n家族史：",
							"\n    父亲体质：",
							"#好",
							"#一般",
							"#差",
							"#已故",
							"传染病史及其接触史：",
							"#无",
							"",
							"母亲体质：",
							"#好",
							"#一般",
							"#差",
							"#已故",
							"家族性遗传疾病：",
							"#无",
							"",
							"\n    父母近亲结婚：",
							"#否",
							"",
							"单亲家庭：",
							"#是；",
							"#否；"});
			
				m_objPrintMultiItemArr[7].m_mthSetPrintValue(new string[]{
														"家族史>>母妊娠史",
														"家族史>>同胞年龄及健康情况",""},
					new string[]{
								"\n    母妊娠史：",
								"\n    同胞年龄及健康情况：",""});
			
			#endregion

			#region 体格检查

			#region 一般测量
 						m_objPrintMultiItemArr[8].m_mthSetPrintValue(new string[]{
																		"",
																		"体格检查>>一般测量>>体温",
																		"体格检查>>一般测量>>体温",
																		"体格检查>>一般测量>>呼吸",
																		"体格检查>>一般测量>>呼吸",
																		"体格检查>>一般测量>>脉搏",
																		"体格检查>>一般测量>>脉搏",
																		"体格检查>>一般测量>>血压1",
																		"",
																		"体格检查>>一般测量>>血压2",
																		"体格检查>>一般测量>>血压2",
																		"体格检查>>一般测量>>体重",
																		"体格检查>>一般测量>>体重",
																		"体格检查>>一般测量>>身高",
																		"体格检查>>一般测量>>身高",
																		"体格检查>>一般测量>>头围",
																		"体格检查>>一般测量>>头围",
																		"体格检查>>一般测量>>姿势",
																		"体格检查>>一般测量>>步态",""},
											new string[]{
																		"\n体格检查",
																		"\n    体温：",
																		"#℃",
																		"呼吸：",
																		"#次/分",
																		"脉搏：",
																		"#次/分",
																		"血压：",
																		"/$$",
																		"$$",
																		"#mmHg",
																		"\n    体重：",
																		"#kg",
																		"身高：",
																		"#cm",
																		"头围：",
																		"#cm",
																		"姿势：",
																		"步态：",""});
		#endregion 

			#region 一般情况
		//
				m_objPrintMultiItemArr[9].m_mthSetPrintValue(new String[]{
																		"",
																		"",
																		"体格检查>>一般情况>>发育>>正常",
																		"体格检查>>一般情况>>发育>>一般",
																		"体格检查>>一般情况>>发育>>差",
																		"",
																		"体格检查>>一般情况>>面部表情>>急性病容",
																		"体格检查>>一般情况>>面部表情>>慢性病容",
																		"体格检查>>一般情况>>面部表情>>特殊病容",
																		"体格检查>>一般情况>>面部表情",
																		"",
																		"体格检查>>一般情况>>营养>>良好",
																		"体格检查>>一般情况>>营养>>中等",
																		"体格检查>>一般情况>>营养>>不良",
																		"",
																		"体格检查>>一般情况>>精神>>正常",
																		"体格检查>>一般情况>>精神>>烦躁",
																		"体格检查>>一般情况>>精神>>疲倦",
																		"体格检查>>一般情况>>精神>>萎靡",
																		"",
																		"体格检查>>一般情况>>神志>>清醒",
																		"体格检查>>一般情况>>神志>>淡漠",
																		"体格检查>>一般情况>>神志>>躁动",
																		"体格检查>>一般情况>>神志>>模糊",
																		"体格检查>>一般情况>>神志>>嗜睡",
																		"体格检查>>一般情况>>神志>>昏迷"},
					new String[]{
								"\n一般情况：", 
								"\n    发育：",
								"#正常",
								"#中等",
								"#差",
								"面部表情：",
								"#急性病容",
								"#慢性病容",
								"#特殊病容",
								"",
								"营养：",
								"#良好",
								"#中等",
								"#不良",
								"精神：",
								"#正常",
								"#烦躁",
								"#疲倦",
								"#萎靡",
								"神志：",
								"#清醒；",
								"#淡漠；",
								"#躁动；",
								"#模糊；",
								"#嗜睡；",
								"#昏迷；"});
				m_objPrintMultiItemArr[9].m_mthSetPrintValue(new String[]{
																		"",  
																		"体格检查>>一般情况>>病情>>轻度",
																		"体格检查>>一般情况>>病情>>中等",
																		"体格检查>>一般情况>>病情>>严重",
																		"体格检查>>一般情况>>病情>>危重",
																		"",
																		"体格检查>>一般情况>>脱水>>无",
																		"体格检查>>一般情况>>脱水>>轻度",
																		"体格检查>>一般情况>>脱水>>中度",
																		"体格检查>>一般情况>>脱水>>重度"},
					new String[]{
								"\n    病情：", 
								"#轻度",
								"#正等",
								"#严重",
								"#危重",
								"脱水：",
								"#无",
								"#轻度；",
								"#中度；",
								"#重度；"
								});

			#endregion

			#region 皮肤粘膜
				m_objPrintMultiItemArr[10].m_mthSetPrintValue(new String[]{
																			"",
																			"",
																			"体格检查>>皮肤粘膜>>色泽>>正常",
																			"体格检查>>皮肤粘膜>>色泽>>红润",
																			"体格检查>>皮肤粘膜>>色泽>>青紫",
																			"体格检查>>皮肤粘膜>>色泽>>黄染",
																			"体格检查>>皮肤粘膜>>色泽>>苍白",
																			"体格检查>>皮肤粘膜>>色泽>>花斑纹",
																			"",
																			"体格检查>>皮肤粘膜>>温度>>灼热",
																			"体格检查>>皮肤粘膜>>温度>>温暖",
																			"体格检查>>皮肤粘膜>>温度>>冰冷", 
																			"",
																			//"",
																			"体格检查>>皮下脂肪>>弹性>>良好",
																			"体格检查>>皮下脂肪>>弹性>>中等",
																			"体格检查>>皮下脂肪>>弹性>>不良",
																			"","体格检查>>皮下脂肪>>皮疹>>出血点",
																			"体格检查>>皮下脂肪>>皮疹>>湿疹",
																			"体格检查>>皮下脂肪>>疤痕",
																			"体格检查>>皮下脂肪>>皮疹>>其他",
																			"体格检查>>皮下脂肪>>皮疹",
                                                                            "体格检查>>皮下脂肪>>皮疹>>无",""},
					new String[]{
								"皮肤粘膜：",
								"\n    色泽：",
								"#正常",
								"#红润",
								"#青紫",
								"#黄染",
								"#苍白",
								"#花斑纹",
								"温度：",
								"#灼热",
								"#温暖",
								"#冰冷",
								"皮肤弹性：",
								//"弹性：",
								"#良好",
								"#中等",
								"#松弛",
								"皮疹：",
								"#出血点",
								"#湿疹",
								"#疤痕",
								"#其他：",
								"部位：$$",
                                "#无",""});

			#endregion

			#region 淋巴结
				m_objPrintMultiItemArr[11].m_mthSetPrintValue(new String[]{
																			"",
																			"体格检查>>淋巴结>>未能触及",
																			"体格检查>>淋巴结>>肿大",
																			"体格检查>>淋巴结>>肿大部位",
																			"体格检查>>淋巴结>>肿大大小",
																			"体格检查>>淋巴结>>肿大形状",""},
					new String[]{
								"淋巴结：",
								"#未能触及",
								"#肿大：",
								"部位：$$",
								"大小：",
								"形状：",""});

			#endregion

			#region 头部

				#region 头部
					m_objPrintMultiItemArr[12].m_mthSetPrintValue(new String[]{
																				"",
																				"",
																				"",
																				"体格检查>>头部>>头>>颅骨>>正常",
																				"体格检查>>头部>>头>>颅骨>>方颅",
																				"体格检查>>头部>>头>>颅骨>>其他畸形",
																				"体格检查>>头部>>头>>颅骨",
																				"",
																				"体格检查>>头部>>头>>前囱>>闭合",
																				"体格检查>>头部>>头>>前囱>>未闭",
                                                                                "体格检查>>头部>>头>>前囱",
                                                                                "体格检查>>头部>>头>>前囱>>隆起",
                                                                                "体格检查>>头部>>头>>前囱>>凹陷",
																				"体格检查>>头部>>头>>前囱>>平坦",
																				"",
																				"体格检查>>头部>>头>>头发>>疏",
																				"体格检查>>头部>>头>>头发>>密",
																				"体格检查>>头部>>头>>头发>>秃",
                                                                                "体格检查>>头部>>头>>头发>>正常",
																				"",
																				"体格检查>>头部>>头>>头发>>色泽>>黑",
																				"体格检查>>头部>>头>>头发>>色泽>>黄",
																				"",
																				"体格检查>>头部>>头>>五官畸形>>无",
																				"体格检查>>头部>>头>>五官畸形",""},
								new String[]{
											"头部",
											"\n    头颅：",
											"\n        形态：",
											"#正常",
											"#方颅",
											"#其他畸形",
											"",
											"前囟：",
											"#闭合",
											"#未闭",
                                            "，约$$",
                                            "#mm，隆起$$",
                                    		"#mm，凹陷$$",
											"#mm，平坦$$",
											"头发：",
											"#疏",
											"#密",
											"#秃",
                                            "#正常",
											"色泽：",
											"#黑",
											"#黄",
											"五官畸形：",
											"#无",
											"",""});
		#endregion 

				#region 眼部
							m_objPrintMultiItemArr[13].m_mthSetPrintValue(new String[]{
																					"",
																					"",
																					"体格检查>>头部>>眼>>眼眶>>正常",
																					"体格检查>>头部>>眼>>眼眶>>凹陷",
																					"",
																					"体格检查>>头部>>眼>>眼脸>>正常",
																					"体格检查>>头部>>眼>>眼脸>>浮肿",
																					"体格检查>>头部>>眼>>眼脸>>下垂",
																					"",
																					"体格检查>>头部>>眼>>眼球>>正常",
																					"体格检查>>头部>>眼>>眼球>>凸出",
																					"体格检查>>头部>>眼>>眼球>>运动障碍",
																					"体格检查>>头部>>眼>>眼球>>震颤",
																					"体格检查>>头部>>眼>>眼球>>斜视", 
																					"",
																					"体格检查>>头部>>眼>>结膜>>正常",
																					"体格检查>>头部>>眼>>结膜>>充血",
																					"体格检查>>头部>>眼>>结膜>>苍白",
																					"体格检查>>头部>>眼>>结膜>>滤泡",
																					"",
																					"体格检查>>头部>>眼>>巩膜>>正常",
																					"体格检查>>头部>>眼>>巩膜>>黄染",
																					"体格检查>>头部>>眼>>巩膜>>出血",
																					"",
																					"体格检查>>头部>>眼>>角膜>>正常",
																					"体格检查>>头部>>眼>>角膜>>其他",
																					"体格检查>>头部>>眼>>角膜",
																					"",
																					"体格检查>>头部>>眼>>瞳孔>>左直径",
																					"体格检查>>头部>>眼>>瞳孔>>左直径",
																					"",
																					"体格检查>>头部>>眼>>瞳孔>>右直径",
																					"体格检查>>头部>>眼>>瞳孔>>右直径",
																					"",
																					"体格检查>>头部>>眼>>对光反射>>存在",
																					"体格检查>>头部>>眼>>对光反射>>迟缓",
																					"体格检查>>头部>>眼>>对光反射>>消失",},
								new String[]{
											"    眼部：",
											"\n        眼眶：",
											"#正常",
											"#凹陷",
											"眼脸：",
											"#正常",
											"#浮肿",
											"#小垂",
											"眼球：",
											"#正常",
											"#凸出",
											"#运动障碍",
											"#震颤",
											"#斜视",
											"结膜：",
											"#正常",
											"#充血",
											"#苍白",
											"#滤泡",
											"巩膜：",
											"#正常",
											"#黄染",
											"#出血",
											"\n        角膜：",
											"#正常",
											"#其它",
											"",
											"瞳孔：左直径",
											"","#mm",
											"右直径",
											"",
											"#mm",
											"对光反射：",
											"#存在；",
											"#迟缓；",
											"#消失；",});
#endregion 
			 
				#region 耳部
					m_objPrintMultiItemArr[14].m_mthSetPrintValue(new String[]{
																			"",
																			"",
																			"体格检查>>头部>>耳部>>外形>>正常",
                                                                            "体格检查>>头部>>耳部>>外形>>畸形",
																			"体格检查>>头部>>耳部>>外形>>畸形形状",
																			"",
																			"体格检查>>头部>>耳部>>外耳道分泌物",
																			"",
																			"体格检查>>头部>>耳部>>乳突压痛>>无",
																			//"体格检查>>头部>>耳部>>乳突压痛>>有",
																			"体格检查>>头部>>耳部>>乳突压痛>>有>>左",
																			"体格检查>>头部>>耳部>>乳突压痛>>有>>右",
                                                                            "体格检查>>头部>>耳部>>乳突压痛>>有>>双侧"},
						new String[]{
									"    耳部：",
									"\n        外形：",
									"#正常",
									"#畸形：","$$",
									"外耳道分泌物：",
									"",
									"乳突压痛：",
									"#无；",
									//"#有",
									"#左；",
									"#右；",
                                    "#双侧；"});
#endregion 
				 
				#region 鼻部
					m_objPrintMultiItemArr[15].m_mthSetPrintValue(new String[]{
																			"",
																			"",
																			"体格检查>>头部>>鼻部>>外形>>正常",
                                                                            "体格检查>>头部>>鼻部>>外形>>畸形",
																			"体格检查>>头部>>鼻>>外形",
																			"",
																			"体格检查>>头部>>鼻>>鼻翼>>正常",
																			"体格检查>>头部>>鼻>>鼻翼>>扇动",
																			"",
																			"体格检查>>头部>>鼻>>分泌物>>无",
																			"体格检查>>头部>>鼻>>分泌物>>粘性",
																			"体格检查>>头部>>鼻>>分泌物>>血样",
																			"体格检查>>头部>>鼻>>分泌物>>脓样", 
																			"",
																			"体格检查>>头部>>鼻部>>副鼻窦压痛>>无",
																			"体格检查>>头部>>鼻部>>副鼻窦压痛>>有",
																			"体格检查>>头部>>鼻部>>副鼻窦压痛>>有>>左",
																			"体格检查>>头部>>鼻部>>副鼻窦压痛>>有>>右",
                                                                            "体格检查>>头部>>鼻部>>副鼻窦压痛>>有>>双侧"},
						new String[]{
									"    鼻部：",
									"\n        外形：",
									"#正常","#畸形：","$$","鼻翼：",
									"#正常","#煽动","分泌物：",
									"#无",
									"#粘性",
									"#血样",
									"#脓样",
									"副鼻窦压痛：",
									"#无；",
									"#有：",
									"#左；",
									"#右；",
                                    "#双侧；"});
#endregion 
				 
				#region 口腔
					m_objPrintMultiItemArr[16].m_mthSetPrintValue(new String[]{
																			"",
																			"",
																			"体格检查>>头部>>口腔>>气味>>正常",
																			"体格检查>>头部>>口腔>>气味>>异常",
																			"",
																			"体格检查>>头部>>口腔>>张口呼吸>>有",
																			"体格检查>>头部>>口腔>>张口呼吸>>无",
																			"",
																			"体格检查>>头部>>口腔>>唇>>正常",
																			"体格检查>>头部>>口腔>>唇>>苍白",
																			"体格检查>>头部>>口腔>>唇>>干燥",
																			"体格检查>>头部>>口腔>>唇>>发绀",
																			"体格检查>>头部>>口腔>>唇>>疱疹",
																			"体格检查>>头部>>口腔>>唇>>皲裂",
																			"",
																			"体格检查>>头部>>口腔>>粘膜>>正常",
																			"体格检查>>头部>>口腔>>粘膜>>溃烂",
																			"体格检查>>头部>>口腔>>粘膜>>鹅口疮",
																			"体格检查>>头部>>口腔>>粘膜>>麻疹粘膜斑",
																			"",
																			"体格检查>>头部>>口腔>>粘膜",""},
						new String[]{
									"    口腔：",
									"\n        气味：",
									"#正常",
									"#异常",
									"张口呼吸：",
									"#有",
									"#无",
									"唇部：",
									"#正常",
									"#苍白",
									"#发绀",
									"#干燥",
									"#疱疹",
									"#皲裂",
									"粘膜：",
									"#正常",
									"#溃烂",
									"#鹅口疮",
									"#麻疹粘膜斑",
									"腮腺管开口情况：",
									"$$",""});
					m_objPrintMultiItemArr[16].m_mthSetPrintValue(new String[]{
																			"",
																			"体格检查>>头部>>口腔>>腭>>颚裂",
																			"体格检查>>头部>>口腔>>腭>>淤点",
																			"体格检查>>头部>>口腔>>腭>>溃烂",
                                                                            "体格检查>>头部>>口腔>>腭>>正常",
                                                                            "",
																			"",
																			"体格检查>>头部>>口腔>>牙龈>>正常",
																			"体格检查>>头部>>口腔>>牙龈>>红肿",
																			"体格检查>>头部>>口腔>>牙龈>>出血",
																			"体格检查>>头部>>口腔>>牙龈>>流脓",
																			"体格检查>>头部>>口腔>>牙龈>>溃烂",
                                                                            "",
																			"体格检查>>头部>>口腔>>舌>>正常",
																			"体格检查>>头部>>口腔>>舌>>溃烂",
																			"体格检查>>头部>>口腔>>舌>>震颤",
																			"体格检查>>头部>>口腔>>舌>>伸舌困难",
																			"体格检查>>头部>>口腔>>舌>>对称性",
																			"体格检查>>头部>>口腔>>舌>>伸舌出口外",
																			"体格检查>>头部>>口腔>>舌>>舌有无囊肿",
																			"体格检查>>头部>>口腔>>舌>>其他",
                                                                            "体格检查>>头部>>口腔>>舌>>其他>>内容",
																			"",
																			"体格检查>>头部>>口腔>>扁桃体>>正常",
																			"体格检查>>头部>>口腔>>扁桃体>>充血",
																			"体格检查>>头部>>口腔>>扁桃体>>肿大",
                                                                            "体格检查>>头部>>口腔>>扁桃体>>肿大>>左",
																			"体格检查>>头部>>口腔>>扁桃体>>肿大>>左>>1级",
																			"体格检查>>头部>>口腔>>扁桃体>>肿大>>左>>2级",
																			"体格检查>>头部>>口腔>>扁桃体>>肿大>>左>>3级",
                                                                            "体格检查>>头部>>口腔>>扁桃体>>肿大>>右",
																			"体格检查>>头部>>口腔>>扁桃体>>肿大>>右>>1级",
																			"体格检查>>头部>>口腔>>扁桃体>>肿大>>右>>2级",
																			"体格检查>>头部>>口腔>>扁桃体>>肿大>>右>>3级",
																			"体格检查>>头部>>口腔>>扁桃体>>脓点或假膜",
                                                                            "体格检查>>头部>>口腔>>扁桃体>>肿大",
																			""},
						new String[]{
									"腭：",
									"#腭裂",
									"#淤点",
									"#溃烂",
                                    "#正常",
                                    "",
									"\n        牙龈：$$",
									"#正常",
									"#红肿",
									"#出血",
									"#流脓",
									"#溃烂",
                                    "舌：",
									"#正常；",
									"#溃烂；",
									"#震颤；",
									"#伸舌困难；",
									"#对称性；",
									"#伸舌出口外；",
									"#舌有无囊肿；",
									"#其他：","$$",
									"扁桃体：",
									"#正常",
									"#充血",
									"#肿大（",
                                    "#左：",
									"#Ⅰ级；",
									"#Ⅱ级；",
									"#Ⅲ级；",
                                    "#右：",
                                    "#Ⅰ级",
									"#Ⅱ级",
									"#Ⅲ级",
									"#脓点或假膜",
                                    "#）",
									""});
					m_objPrintMultiItemArr[16].m_mthSetPrintValue(new String[]{
																			"",
																			"体格检查>>头部>>口腔>>咽部>>正常",
																			"体格检查>>头部>>口腔>>咽部>>充血",
																			"体格检查>>头部>>口腔>>咽部>>脓点",
																			"",
																			"体格检查>>头部>>口腔>>咽部",
                                                                            "",
																			"",
																			"体格检查>>头部>>口腔>>发音>>正常",
																			"体格检查>>头部>>口腔>>发音>>嘶哑",
																			"体格检查>>头部>>口腔>>发音>>微弱",
																			"体格检查>>头部>>口腔>>发音>>失声",
																			"体格检查>>头部>>口腔>>发音>>喉喘鸣",
																			"",
																			"体格检查>>头部>>口腔>>牙齿",
																			"体格检查>>头部>>口腔>>牙齿",
																			"",
																			"体格检查>>头部>>口腔>>龋齿",""},
						new String[]{
									"咽部：",
									"#正常",
									"#充血",
									"#分泌物或假膜",
									"吞咽情况：",
									"$$",
                                    "",
									"\n        发音：$$",
									"#正常",
									"#嘶哑",
									"#微弱",
									"#失声",
									"#喉喘鸣",
									"牙齿：共",
									"",
									"#只；",
									"龋牙：$$",
									"",""});
#endregion 
				 


				 
			#endregion

			#region 颈部
					m_objPrintMultiItemArr[17].m_mthSetPrintValue(new String[]{
																				"",
																				"",
																				"体格检查>>头部>>颈>>形态",
																				"",
																				"体格检查>>头部>>颈>>甲状腺>>正常",
																				"体格检查>>头部>>颈>>甲状腺>>肿大",
																				"体格检查>>头部>>颈>>甲状腺",
																				"",
																				"体格检查>>头部>>颈>>气管>>居中",
																				"体格检查>>头部>>颈>>气管>>偏移",
																				"体格检查>>头部>>颈>>气管>>偏移>>左",
																				"体格检查>>头部>>颈>>气管>>偏移>>右",
																				"",
																				"体格检查>>头部>>颈>>颈静脉>>无",
																				"体格检查>>头部>>颈>>颈静脉>>有"},
						new String[]{
										"颈部：",
										"\n    形态：",
										"",
										"甲状腺：",
										"#正常",
										"#肿大",
										"",
										"气管：",
										"#居中",
										"#偏移",
										"#左",
										"#右",
										"颈静脉怒张：",
										"#无；",
										"#有；",});
		#endregion 		

			#region 胸廓
		m_objPrintMultiItemArr[18].m_mthSetPrintValue(new String[]{
																"",
																"体格检查>>头部>>胸廓",""},
			new String[]{
					"\n胸廓：",
                    "",""});

			#endregion

			#region 肺部
		m_objPrintMultiItemArr[19].m_mthSetPrintValue(new String[]{
																"",
																"",
																"体格检查>>肺部>>呼吸>>平稳",
																"体格检查>>肺部>>呼吸>>表浅",
																"体格检查>>肺部>>呼吸>>急促",
																"体格检查>>肺部>>呼吸>>困难",
																"体格检查>>肺部>>呼吸>>点头",
																"",
																//"体格检查>>肺部>>触诊>>语颤",
																"体格检查>>肺部>>触诊",
																"",
																"体格检查>>肺部>>叩诊>>清音",
																"体格检查>>肺部>>叩诊>>过清音",
																"体格检查>>肺部>>叩诊>>浊音",
																"体格检查>>肺部>>叩诊>>实音",
																"体格检查>>肺部>>叩诊>>鼓音",
                                                                "体格检查>>肺部>>叩诊>>鼓音>>部位",
                                                                "体格检查>>肺部>>叩诊>>鼓音",
																"",
																"体格检查>>肺部>>双肺呼吸音>>清晰",
																"体格检查>>肺部>>双肺呼吸音>>稍粗",
																"体格检查>>肺部>>双肺呼吸音>>粗",
																"",
                                                                "体格检查>>肺部>>呼吸音低>>无",
																"体格检查>>肺部>>呼吸音低>>左",
																"体格检查>>肺部>>呼吸音低>>右",
                                                                "体格检查>>肺部>>呼吸音低>>双侧",
                                                                "",
                                                                "体格检查>>肺部>>罗音>>无",
                                                                "体格检查>>肺部>>罗音>>有",
                                                                "体格检查>>肺部>>罗音>>有>>内容",
                                                                "体格检查>>肺部>>罗音>>有",
																"",
																"体格检查>>肺部>>胸膜摩擦音>>无",
																"体格检查>>肺部>>胸膜摩擦音>>有",
																"体格检查>>肺部>>胸膜摩擦音>>有>>左",
																"体格检查>>肺部>>胸膜摩擦音>>有>>右",
                                                                "",
                                                                "体格检查>>肺部>>触诊>>皮下捻发感>>无",
                                                                "体格检查>>肺部>>触诊>>皮下捻发感>>有",
                                                                "体格检查>>肺部>>触诊>>皮下捻发感>>内容",""},
			new String[]{
						"\n肺部：",
						"\n    呼吸：",
						"#平稳",
						"#表浅",
						"#急促",
						"#困难",
						"#点头",
						"触觉语颤：",
						//"#语颤",
						"",
						"叩诊：",
						"#清音；",
						"#过清音；",
						"#浊音；",
						"#实音；",
						"#鼓音(部位：",
                        "$$",
                        "#)；$$",
						"双肺呼吸音：$$",
						"#清晰",
						"#稍粗",
						"#粗",
						"\n    呼吸音低：",
                        "#无；",
						"#左；",
						"#右；",
                        "#双侧；",
                        "罗音：$$",
                        "#无；",
                        "#有（",
                        "$$",
                        "#）；",
						"胸膜摩擦音：$$",
						"#无",
						"#有：",
						"#左$$",
						"#右$$",
                        "皮下捻发感：",
                        "#无",
                        "#有：",
                        "$$",""});

			#endregion

			#region 心脏
		m_objPrintMultiItemArr[20].m_mthSetPrintValue(new String[]{
																"",
																"",
																"体格检查>>心脏>>心前区隆起>>无",
																"体格检查>>心脏>>心前区隆起>>有",
																"",
																"体格检查>>心脏>>心尖搏动",
																"",
																"体格检查>>心脏>>心界",
																"",
																"体格检查>>心脏>>心率",
																"体格检查>>心脏>>心率",
																"",
																"体格检查>>心脏>>心律>>齐",
																"体格检查>>心脏>>心律>>不齐",
																"体格检查>>心脏>>心律>>奔马律",
																"",
																"体格检查>>心脏>>心音>>正常",
																"体格检查>>心脏>>心音>>低钝",
																"体格检查>>心脏>>心音>>增强",
																"体格检查>>心脏>>心音>>分裂",
																"",
																"体格检查>>心脏>>杂音>>无",
																"体格检查>>心脏>>杂音",
																"",
																"体格检查>>肺部>>心包摩擦音>>无",
																//"体格检查>>心脏>>心包摩擦音>>有",
																"体格检查>>肺部>>心包摩擦音>>有>>左",
																"体格检查>>肺部>>心包摩擦音>>有>>右",""},
			new String[]{
						"\n心脏：",
						"\n    心前区隆起：",
						"#无",
						"#有",
						"心尖搏动：",
						"",
						"心界：",
						"",
						"心率：",
						"",
						"#次/分",
						"心律：",
						"#齐",
						"#不齐",
						"#奔马律",
						"\n    心音：",
						"#正常",
						"#低钝",
						"#增强",
						"#分裂",
						"杂音",
						"#无",
						"",
						"心包摩擦音：",
						"#无",
						//"#有",
						"#左",
						"#右",""});

			#endregion

			#region 腹部
        /*
				m_objPrintMultiItemArr[21].m_mthSetPrintValue(new String[]{
																	"",
																	"",
																	"体格检查>>腹部>>外形>>平坦",
																	"体格检查>>腹部>>外形>>膨隆",
																	"体格检查>>腹部>>外形>>凹陷",
																	"",
																	"体格检查>>腹部>>腹部静脉>>正常",
																	"体格检查>>腹部>>腹部静脉>>显露",
																	"体格检查>>腹部>>腹部静脉>>怒张",
																	"",
																	"体格检查>>腹部>>质地>>软",
																	"体格检查>>腹部>>质地>>柔软",
																	"体格检查>>腹部>>质地>>硬",
																	"",
																	"体格检查>>腹部>>压痛反跳痛>>无",
																	"体格检查>>腹部>>压痛反跳痛>>有",
																	"体格检查>>腹部>>压痛反跳痛",
																	"",
																	"体格检查>>腹部>>包块部位",
																	"",
																	"体格检查>>腹部>>包块性质",
																	"","体格检查>>腹部>>包块大小",
																	"",
																	"体格检查>>腹部>>其他",""},
																						new String[]{
																	"\n腹部：",
																	"\n    形态：",
																	"#平坦",
																	"#隆起",
																	"#凹陷",
																	"腹壁静脉：",
																	"#正常",
																	"#显露",
																	"#怒张",
																	"质地：",
																	"#软",
																	"#柔软",
																	"#硬",
																	"压痛反跳痛：",
																	"#无",
																	"#有：",
																	"",
																	"\n    包块部位：",
																	"",
																	"包块性质：",
																	"",
																	"包块大小：",
																	"",
																	"其他：",
																	"",""});
         */
				m_objPrintMultiItemArr[21].m_mthSetPrintValue(new String[]{
                                                                            "",
																	        "",
																	        "体格检查>>腹部>>外形>>平坦",
																	        "体格检查>>腹部>>外形>>膨隆",
																	        "体格检查>>腹部>>外形>>凹陷",
																	        "",
																	        "体格检查>>腹部>>腹部静脉>>正常",
																	        "体格检查>>腹部>>腹部静脉>>显露",
																	        "体格检查>>腹部>>腹部静脉>>怒张",
																	        "",
																	        "体格检查>>腹部>>质地>>软",
																	        "体格检查>>腹部>>质地>>柔软",
																	        "体格检查>>腹部>>质地>>硬",
																	        "",
																	        "体格检查>>腹部>>压痛反跳痛>>无",
																	        "体格检查>>腹部>>压痛反跳痛>>有",
																	        "体格检查>>腹部>>压痛反跳痛",
																	        "",
                                                                            "体格检查>>腹部>>包块>>无",
                                                                            "体格检查>>腹部>>包块>>有",
																	        "体格检查>>腹部>>包块部位",
                                                                            "体格检查>>腹部>>包块>>有",
																	        "体格检查>>腹部>>包块性质",
                                                                            "体格检查>>腹部>>包块>>有",
																	        "体格检查>>腹部>>包块大小",
																	        "体格检查>>腹部>>包块>>有",
                                                                            "",
																	        "体格检查>>腹部>>其他","",
																			"",
																			"体格检查>>腹部>>肝脏>>不可触及",
																			"体格检查>>腹部>>肝脏>>仅可触及",
																			"体格检查>>腹部>>肝脏>>增大",
																			//"",
																			"体格检查>>腹部>>肝脏增大",
																			"体格检查>>腹部>>肝脏增大",
																			//"",
																			"体格检查>>腹部>>肝脏>>质地>>软",
																			"体格检查>>腹部>>肝脏>>质地>>中",
																			"体格检查>>腹部>>肝脏>>质地>>硬",
																			"",
																			"体格检查>>腹部>>脾脏>>不可触及",
																			"体格检查>>腹部>>脾脏>>仅可触及",
																			"体格检查>>腹部>>脾脏>>增大",
																			//"",
																			"体格检查>>腹部>>脾脏增大",
																			"体格检查>>腹部>>脾脏增大",
																			//"",
																			"体格检查>>腹部>>脾脏>>质地>>软",
																			"体格检查>>腹部>>脾脏>>质地>>中",
																			"体格检查>>腹部>>脾脏>>质地>>硬",
																			"",
																			"体格检查>>腹部>>肾脏>>不可触及",
																			"体格检查>>腹部>>肾脏>>仅可触及",
																			"",
																			"体格检查>>腹部>>叩诊>>正常",
																			"体格检查>>腹部>>叩诊>>鼓音",
                                                                            "体格检查>>腹部>>叩诊>>鼓音>>内容",
																			"体格检查>>腹部>>叩诊>>移动性浊音",
                                                                            "",
																			"体格检查>>腹部>>肠鸣音>>正常",
																			"体格检查>>腹部>>肠鸣音>>减弱",
																			"体格检查>>腹部>>肠鸣音>>亢进",
																			"体格检查>>腹部>>肠鸣音>>消失",""},
					new String[]{
                                "\n腹部：",
								"\n    形态：",
								"#平坦",
								"#膨隆",
								"#凹陷",
								"腹壁静脉：",
								"#正常",
								"#显露",
								"#怒张",
								"质地：",
								"#软",
								"#柔软",
								"#硬",
								"压痛反跳痛：",
								"#无",
								"#有：",
								"$$",
								"\n    腹部包块：",
                                "#无",
                                "#有（包块部位：",
								"$$",
								"#；包块性质：",
								"$$",
								"#；包块大小：",
								"$$",
                                "#）",
								"其他：",
								"","",
								"\n    肝脏：$$",
								"#不可触及",
								"#仅可触及",
								"#增大：右肋下 ",
								//"右肋下$$",
								"$$",
								"#cm；",
								//"质地：",
								"#质地：软",
								"#质地：中",
								"#质地：硬",
								"\n    脾脏：",
								"#不可触及",
								"#仅可触及",
								"#增大：左肋下 ",
								//"左肋下$$",
								"$$",
								"#cm；",
								//"质地：",
								"#质地：软",
								"#质地：中",
								"#质地：硬",
								"\n    肾脏：",
								"#不可触及",
								"#仅可触及",
								"叩诊：",
								"#正常",
								"#鼓音，",
                                "部位：$$",
								"#移动性浊音",
                                "肠鸣音：",
								"#正常",
								"#减弱",
								"#亢进",
								"#消失",""});

			#endregion

			#region 肛门外生殖器
				m_objPrintMultiItemArr[22].m_mthSetPrintValue(new String[]{
																			"",
																			"",
																			"体格检查>>肛门外生殖器>>肛门>>正常",
																			"体格检查>>肛门外生殖器>>肛门>>闭锁",
																			"体格检查>>肛门外生殖器>>肛门>>肛周红肿",
																			"体格检查>>肛门外生殖器>>肛门>>皲裂",
																			"体格检查>>肛门外生殖器>>肛门>>息肉",
																			"体格检查>>肛门外生殖器>>肛门>>脱肛",
																			"体格检查>>肛门外生殖器>>肛门>>外痔",
																			"",
																			"体格检查>>肛门外生殖器>>外生殖器>>无异常",
																			"体格检查>>肛门外生殖器>>外生殖器",
																			"",
																			"体格检查>>肛门外生殖器>>湿疹>>无",
																			"体格检查>>肛门外生殖器>>湿疹>>有",
																			"体格检查>>肛门外生殖器>>湿疹",
																			"","体格检查>>肛门外生殖器>>会阴部",
																			"","体格检查>>肛门外生殖器>>睾丸",
																			"","体格检查>>肛门外生殖器>>阴囊",
																			"",
																			"体格检查>>肛门外生殖器>>外阴部>>红肿>>无",
																			"体格检查>>肛门外生殖器>>外阴部>>红肿>>有",
																			"",
																			"体格检查>>肛门外生殖器>>外阴部>>分泌物>>无",
																			"体格检查>>肛门外生殖器>>外阴部>>分泌物>>有",
																			"",
																			"体格检查>>肛门外生殖器>>外阴部>>畸形>>无",
																			"体格检查>>肛门外生殖器>>外阴部>>畸形>>有",
																			"体格检查>>肛门外生殖器>>外阴部>>畸形",""},
                    new String[] { "\n肛门外生殖器：", "\n    肛门：", "#正常", "#闭锁", "#肛周红肿", "#皲裂", "#息肉", "#脱肛", "#外痔", "外生殖器：", "#无异常", "", "湿疹：", "#无", "#有：", "$$", "会阴部：", "", "睾丸：", "", "阴囊：", "", "\n    外阴部：红肿：", "#无", "#有", "分泌物：", "#无", "#有", "畸形：", "#无", "#有：", "$$", "" });

			#endregion

			#region 四肢脊柱
				m_objPrintMultiItemArr[23].m_mthSetPrintValue(new String[]{
																			"",
																			"","体格检查>>四肢脊柱>>四肢>>正常",
																			"体格检查>>四肢脊柱>>四肢>>畸形",
																			"体格检查>>四肢脊柱>>四肢","",
																			"体格检查>>四肢脊柱>>四肢>>强直",
																			"体格检查>>四肢脊柱>>四肢>>无意识动作",
																			"体格检查>>四肢脊柱>>四肢>>压痛",
																			"体格检查>>四肢脊柱>>四肢>>压痛部位",
                                                                            "体格检查>>四肢脊柱>>四肢>>压痛",
																			"体格检查>>水肿","体格检查>>水肿",
																			"体格检查>>四肢端发绀","体格检查>>四肢端发绀",
																			"",
																			"体格检查>>四肢脊柱>>肌力>>左上肢>>0级",
																			"体格检查>>四肢脊柱>>肌力>>左上肢>>Ⅰ级",
																			"体格检查>>四肢脊柱>>肌力>>左上肢>>Ⅱ级",
																			"体格检查>>四肢脊柱>>肌力>>左上肢>>Ⅲ级",
																			"体格检查>>四肢脊柱>>肌力>>左上肢>>Ⅳ级",
																			"体格检查>>四肢脊柱>>肌力>>左上肢>>Ⅴ级",
                                                                            "",
                                                                            "体格检查>>四肢脊柱>>肌力>>右上肢>>0级",
																			"体格检查>>四肢脊柱>>肌力>>右上肢>>Ⅰ级",
																			"体格检查>>四肢脊柱>>肌力>>右上肢>>Ⅱ级",
																			"体格检查>>四肢脊柱>>肌力>>右上肢>>Ⅲ级",
																			"体格检查>>四肢脊柱>>肌力>>右上肢>>Ⅳ级",
																			"体格检查>>四肢脊柱>>肌力>>右上肢>>Ⅴ级",
                                                                            "",
                                                                            "体格检查>>四肢脊柱>>肌力>>左下肢>>0级",
																			"体格检查>>四肢脊柱>>肌力>>左下肢>>Ⅰ级",
																			"体格检查>>四肢脊柱>>肌力>>左下肢>>Ⅱ级",
																			"体格检查>>四肢脊柱>>肌力>>左下肢>>Ⅲ级",
																			"体格检查>>四肢脊柱>>肌力>>左下肢>>Ⅳ级",
																			"体格检查>>四肢脊柱>>肌力>>左下肢>>Ⅴ级",
                                                                            "",
                                                                            "体格检查>>四肢脊柱>>肌力>>右下肢>>0级",
																			"体格检查>>四肢脊柱>>肌力>>右下肢>>Ⅰ级",
																			"体格检查>>四肢脊柱>>肌力>>右下肢>>Ⅱ级",
																			"体格检查>>四肢脊柱>>肌力>>右下肢>>Ⅲ级",
																			"体格检查>>四肢脊柱>>肌力>>右下肢>>Ⅳ级",
																			"体格检查>>四肢脊柱>>肌力>>右下肢>>Ⅴ级",
																			"",
																			"体格检查>>四肢脊柱>>肌张力",
																			"",
																			"体格检查>>四肢脊柱>>脊柱>>正常",
																			"体格检查>>四肢脊柱>>脊柱>>侧弯",
																			"体格检查>>四肢脊柱>>脊柱>>触痛",
																			//"",
																			"体格检查>>四肢脊柱>>脊柱",""
																			//"体格检查>>四肢脊柱>>脊柱"
                                                                             },
					new String[]{
								"\n四肢脊柱：",
								"\n    四肢：",
								"#正常",
								"#畸形",
								"，部位：$$",
                                "",
								"#强直；",
								"#无意识动作；",
								"#压痛(部位：",
								"$$",
                                "#)；$$",
								"水肿：$$",
                                "#；$$",
								"四肢端发绀：$$",
                                "#；$$",
								"肌力：左上肢：$$",
								"#0级",
								"#Ⅰ级",
								"#Ⅱ级",
								"#Ⅲ级",
								"#Ⅳ级",
								"#Ⅴ级",
                                "右上肢：",
                                "#0级",
								"#Ⅰ级",
								"#Ⅱ级",
								"#Ⅲ级",
								"#Ⅳ级",
								"#Ⅴ级",
                                "左下肢：",
                                "#0级",
								"#Ⅰ级",
								"#Ⅱ级",
								"#Ⅲ级",
								"#Ⅳ级",
								"#Ⅴ级",
                                "右下肢：",
                                "#0级",
								"#Ⅰ级",
								"#Ⅱ级",
								"#Ⅲ级",
								"#Ⅳ级",
								"#Ⅴ级",
								"肌张力：",
								"$$",
								"脊柱：",
								"#正常",
								"#侧弯",
								"#触痛",
								//"第",
								"",""
								//"#椎裂",
                                });

			#endregion

			#region 神经系统
				m_objPrintMultiItemArr[24].m_mthSetPrintValue(new String[]{"","","体格检查>>神经系统>>膝反射>>左>>正常","体格检查>>神经系统>>膝反射>>左>>亢进","体格检查>>神经系统>>膝反射>>左>>减弱","","体格检查>>神经系统>>膝反射>>右>>正常","体格检查>>神经系统>>膝反射>>右>>亢进","体格检查>>神经系统>>膝反射>>右>>减弱"
																			  ,"","体格检查>>神经系统>>腹壁反射>>左>>正常","体格检查>>神经系统>>腹壁反射>>左>>亢进","体格检查>>神经系统>>腹壁反射>>左>>减弱","","体格检查>>神经系统>>腹壁反射>>右>>正常","体格检查>>神经系统>>腹壁反射>>右>>亢进","体格检查>>神经系统>>腹壁反射>>右>>减弱",""
																			  ,"体格检查>>神经系统>>提睾反射>>左>>正常","体格检查>>神经系统>>提睾反射>>左>>亢进","体格检查>>神经系统>>提睾反射>>左>>减弱","","体格检查>>神经系统>>提睾反射>>右>>正常","体格检查>>神经系统>>提睾反射>>右>>亢进","体格检查>>神经系统>>提睾反射>>右>>减弱",""
																			  ,"","体格检查>>神经系统>>巴氏征>>左","体格检查>>神经系统>>巴氏征>>右","","体格检查>>神经系统>>布氏征>>左","体格检查>>神经系统>>布氏征>>右","","体格检查>>神经系统>>克氏征>>左","体格检查>>神经系统>>克氏征>>右",""},
					new String[]{"\n神经系统：","\n    膝反射(左：","#正常","#亢进","#减弱","右：","#正常$$","#亢进$$","#减弱$$",")；腹壁反射(左：$$","#正常","#亢进","#减弱","右：","#正常$$","#亢进$$","#减弱$$"
									,")；提睾反射(左：$$","#正常","#亢进","#减弱","右：","#正常$$","#亢进$$","#减弱$$",")$$","\n    巴氏征：","左：","右：","布氏征：","左：","右：","克氏征：","左：","右：",""});

			#endregion

			#region 专科检查
				m_objPrintMultiItemArr[25].m_mthSetPrintValue("体格检查>>专科检查","专科检查：");
			#endregion

			#region 辅助检查
				m_objPrintMultiItemArr[27].m_mthSetPrintValue("体格检查>>辅助检查","辅助检查：");

			#endregion

            #region 诊断
                if (m_hasItems != null && m_hasItems.Contains("体格检查>>诊断"))
                {
                    m_objPrintMultiItemArr[28].m_mthSetPrintValue("体格检查>>诊断" ,"诊断：" );
                    if (m_hasItems.Contains("诊断医师签名"))
                    {
                        m_objPrintMultiItemArr[29].m_mthSetPrintValue(new string[] { "诊断医师签名", "诊断日期" },
                                    new string[] { "\n                                                            医师签名：", "                 日期：$$" });
                    }
                    else
                    {
                        m_objPrintMultiItemArr[29].m_mthSetPrintValue(new string[] { "体格检查>>诊断" },
                                    new string[] { "#\n                                                            医师签名：                             日期：" });
                    }
                }

            #endregion
            #region 补充诊断

                if (m_hasItems != null && m_hasItems.Contains("体格检查>>补充诊断"))
                {
                    m_objPrintMultiItemArr[30].m_mthSetPrintValue("体格检查>>补充诊断" ,"补充诊断：" );
                    if (m_hasItems.Contains("补充诊断医师签名"))
                    {
                        m_objPrintMultiItemArr[31].m_mthSetPrintValue(new string[] { "补充诊断医师签名", "补充诊断日期" },
                                    new string[] { "\n                                                            医师签名：", "                 日期：$$" });
                    }
                    else
                    {
                        m_objPrintMultiItemArr[31].m_mthSetPrintValue(new string[] { "体格检查>>补充诊断" },
                                    new string[] { "#\n                                                            医师签名：                             日期：" });
                    }
                }

            #endregion
            
			#region 修正诊断

                if (m_hasItems != null && m_hasItems.Contains("体格检查>>修正诊断"))
                {
                    m_objPrintMultiItemArr[32].m_mthSetPrintValue("体格检查>>修正诊断" , "修正诊断：" );
                    if (m_hasItems.Contains("修正诊断医师签名"))
                    {
                        m_objPrintMultiItemArr[33].m_mthSetPrintValue(new string[] { "修正诊断医师签名", "修正诊断日期" },
                                    new string[] { "\n                                                            医师签名：", "                 日期：$$" });
                    }
                    else
                    {
                        m_objPrintMultiItemArr[33].m_mthSetPrintValue(new string[] { "体格检查>>修正诊断" },
                                    new string[] { "#\n                                                            医师签名：                             日期：" });
                    }
                }
				
			#endregion

			#region 最后诊断
                if (m_hasItems != null && m_hasItems.Contains("体格检查>>最后诊断"))
                {
                    m_objPrintMultiItemArr[34].m_mthSetPrintValue("体格检查>>最后诊断" ,"最后诊断：" );
                    if (m_hasItems.Contains("最后诊断医师签名"))
                    {
                        m_objPrintMultiItemArr[35].m_mthSetPrintValue(new string[] { "最后诊断医师签名", "最后诊断日期" },
                                    new string[] { "\n                                                            医师签名：", "                 日期：$$" });
                    }
                    else
                    {
                        m_objPrintMultiItemArr[35].m_mthSetPrintValue(new string[] { "体格检查>>最后诊断" },
                                    new string[] { "#\n                                                            医师签名：                             日期：" });
                    }
                }

			#endregion
			
			#endregion
			
			#region 签名和日期

                if (m_hasItems != null && (m_hasItems.Contains("签名") || m_hasItems.Contains("上级医师签名")))
                {
                    m_objPrintMultiItemArr[36].m_mthSetPrintValue(new string[] { "", "签名", "", "住院医师签名日期", "", "上级医师签名", "", "日期" },
                        new string[]{"\n\n                                                                                      住院医师签名：","$$",  
                                         "\n                                                                                      签名日期：$$","$$",
                                         "\n                                                                                      上级医师签名：$$","$$",
                                         "\n                                                                                      签名日期：$$","$$"});
                }
                else
                {
                    m_objPrintMultiItemArr[36].m_mthSetPrintValue(new string[] { "日期", "日期", "日期", "日期" },
                            new string[]{"#\n\n                                                                                   住院医师签名：",
                                         "#\n                                                                                   签名日期：$$",
                                         "#\n                                                                                   上级医师签名：$$",
                                         "#\n                                                                                   签名日期：$$"});
                }
					
			#endregion

		}



	#region Print Class

		/// <summary>
		/// 项目打印
		/// </summary>
		private class clsPrintInPatMedRecItem : clsIMR_PrintLineBase
		{
			private clsPrintRichTextContext m_objPrintContext = new clsPrintRichTextContext(Color.Black,new Font("",10));

			/// <summary>
			/// 相同的内容只打印一次(而不是首次打印时间对应的m_blnIsFirstPrint)
			/// </summary>
			private bool m_blnIsFirstPrint = true;
			private string m_strSpecialTitle = "";
			private string m_strTitle = "";
			private string m_strText = "";
			private string m_strTextXml = "";
			private bool m_blnNoContent = false;
			private bool m_blnNoPrint = true;
			private clsInpatMedRec_Item m_objItemContent = null;

			public clsPrintInPatMedRecItem()
			{}
			
			public override void m_mthPrintNextLine(ref int p_intPosY, System.Drawing.Graphics p_objGrp, System.Drawing.Font p_fntNormalText)
			{
				if(m_blnNoContent == true && m_blnNoPrint == true || m_hasItems == null || m_hasItems.Count == 0 || m_objContent == null)
				{
					m_blnHaveMoreLine = false;

					return;
				}

				if(m_blnIsFirstPrint)
				{
					if(m_strTitle != "")
					{
						p_objGrp.DrawString(m_strTitle,p_fntNormalText,Brushes.Black,m_intRecBaseX+10,p_intPosY);
						p_intPosY += 20;

                        if (m_blnIsPrintMark)
                        {
                            m_objPrintContext.m_mthSetContextWithCorrectBefore((m_objItemContent == null ? "" : m_objItemContent.m_strItemContent), (m_objItemContent == null ? "<root />" : m_objItemContent.m_strItemContentXml), m_dtmFirstPrintTime, m_objItemContent != null);
                            m_mthAddSign2(m_strTitle, m_objPrintContext.m_ObjModifyUserArr);
                        }
                        else
                        {
                            m_objPrintContext.m_mthSetContextWithAllCorrect((m_objItemContent == null ? "" : m_objItemContent.m_strItemContent), (m_objItemContent == null ? "<root />" : m_objItemContent.m_strItemContentXml));
                        }

						
					}
					else
					{
						if(m_strSpecialTitle != "")
						{
							p_intPosY += 20;
							p_objGrp.DrawString(m_strSpecialTitle,clsIMR_HerbalismPrintTool.m_fotItemHead,Brushes.Black,m_intRecBaseX+300,p_intPosY);
							p_intPosY += 40;
						}

                        if (m_blnIsPrintMark)
                        {
                            m_objPrintContext.m_mthSetContextWithCorrectBefore(m_strText, m_strTextXml, m_dtmFirstPrintTime, m_blnNoPrint == false);
                            m_mthAddSign2(m_strSpecialTitle, m_objPrintContext.m_ObjModifyUserArr);

                        }
                        else
                        {
                            m_objPrintContext.m_mthSetContextWithAllCorrect(m_strText, m_strTextXml);
                        }

						
					}

					m_blnIsFirstPrint = false;					
				}
			
				int intLine = 0;
				if(m_objPrintContext.m_BlnHaveNextLine())
				{
					if(m_strTitle != "")
						m_objPrintContext.m_mthPrintLine((int)enmRectangleInfoInPatientCaseInfo.PrintWidth+25,m_intRecBaseX+25,p_intPosY,p_objGrp);
					else
						m_objPrintContext.m_mthPrintLine((int)enmRectangleInfoInPatientCaseInfo.PrintWidth2,m_intRecBaseX+10,p_intPosY,p_objGrp);
					p_intPosY += 20;

					intLine++;
				}			

				if(m_objPrintContext.m_BlnHaveNextLine())
					m_blnHaveMoreLine = true;
				else
				{
					m_blnHaveMoreLine = false;
				}
			}

			public override void m_mthReset()
			{
				m_objPrintContext.m_mthRestartPrint();

				m_blnHaveMoreLine = true;

				m_blnIsFirstPrint = true;
			}
			/// <summary>
			/// 设置多项打印内容
			/// </summary>
			/// <param name="p_strKeyArr">打印内容的哈希键数组</param>
			/// <param name="p_strTitleArr">小标题数组(即对应于窗体Lable但不存储于数据库的需打印的内容)</param>
			public void m_mthSetPrintValue(string[] p_strKeyArr,string[] p_strTitleArr)
			{
				if(p_strKeyArr == null || p_strTitleArr == null || p_strKeyArr.Length != p_strTitleArr.Length)
				{
					m_blnNoContent = true;
					return;
				}
				m_blnNoPrint = false;
				if(m_blnHavePrintInfo(p_strKeyArr) == true)
					m_mthMakeText(p_strTitleArr,p_strKeyArr,ref m_strText,ref m_strTextXml);
			}
			/// <summary>
			/// 设置单项打印内容
			/// </summary>
			/// <param name="p_strKey">哈希键</param>
			/// <param name="p_strTitle">小标题</param>
			public void m_mthSetPrintValue(string p_strKey,string p_strTitle)
			{
				if(m_hasItems != null && p_strKey != null)
					if(m_hasItems.Contains(p_strKey))
						m_objItemContent = m_hasItems[p_strKey] as clsInpatMedRec_Item;
				m_strTitle = p_strTitle;
			}
			/// <summary>
			/// 设置大标题如“体格检查”
			/// </summary>
			/// <param name="p_strTitle"></param>
			public void m_mthSetSpecialTitleValue(string p_strTitle)
			{
				m_strSpecialTitle = p_strTitle;
			}

		}

		/// <summary>
		/// 签名和日期
		/// </summary>
		private class clsPrintInPatMedRecSign : clsIMR_PrintLineBase
		{
			private clsInpatMedRec_Item[] objSignContent = null;
			private string[] m_strTitleArr = null;
			public override void m_mthPrintNextLine(ref int p_intPosY, System.Drawing.Graphics p_objGrp, System.Drawing.Font p_fntNormalText)
			{
				if(objSignContent == null)
				{
					m_blnHaveMoreLine = false;
					return;
				}
				p_intPosY += 40;
				for(int i=0; i<objSignContent.Length; i++)
				{
					if(m_strTitleArr[i].IndexOf("日期") < 0)
					{
						p_objGrp.DrawString(m_strTitleArr[i]+(objSignContent[i]==null ? "" : objSignContent[i].m_strItemContent) ,p_fntNormalText,Brushes.Black,m_intRecBaseX+400,p_intPosY);
						p_intPosY += 20;
					}
					else
					{
						p_objGrp.DrawString(m_strTitleArr[i]+ (objSignContent[i] == null ? "" :DateTime.Parse( objSignContent[i].m_strItemContent).ToString("yyyy年MM月dd日")),p_fntNormalText,Brushes.Black,m_intRecBaseX+400,p_intPosY);
						p_intPosY += 20;
					}
				}
				m_blnHaveMoreLine = false;
			}

			public override void m_mthReset()
			{
				m_blnHaveMoreLine = true;
			}
			/// <summary>
			/// 设置签名和日期值
			/// </summary>
			/// <param name="p_strkeyArr">值</param>
			/// <param name="p_strTitleArr">标题</param>
			public void m_mthSetPrintSignValue(string[] p_strkeyArr,string[] p_strTitleArr)
			{
				if(p_strkeyArr == null || p_strTitleArr == null || p_strkeyArr.Length != p_strTitleArr.Length)
					return;
				objSignContent = m_objGetContentFromItemArr(p_strkeyArr);
				m_strTitleArr = p_strTitleArr;
			}

		}

		#endregion
	}
}
